xwos/XWOS/xwbd/stm32f42xdkp/bm/stm32cube/xwds/pm.c
/**
 * @file
 * @brief STM32CUBE：电源管理
 * @author
 * + 隐星魂 (Roy.Sun) <www.starsoul.tech>
 * @copyright
 * + (c) 2015 隐星魂 (Roy.Sun) <www.starsoul.tech>
 * > Licensed under the Apache License, Version 2.0 (the "License");
 * > you may not use this file except in compliance with the License.
 * > You may obtain a copy of the License at
 * >
 * >         http://www.apache.org/licenses/LICENSE-2.0
 * >
 * > Unless required by applicable law or agreed to in writing, software
 * > distributed under the License is distributed on an "AS IS" BASIS,
 * > WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * > See the License for the specific language governing permissions and
 * > limitations under the License.
 */

/******** ******** ******** ******** ******** ******** ******** ********
 ******** ******** ********      include      ******** ******** ********
 ******** ******** ******** ******** ******** ******** ******** ********/
#include <bm/stm32cube/standard.h>
#include <xwmd/ds/xwds.h>
#include <stm32f4xx_ll_cortex.h>
#include <stm32f4xx_ll_pwr.h>
#include <bm/stm32cube/cubemx/Core/Inc/main.h>
#include <bm/stm32cube/xwds/stm32cube.h>
#include <bm/stm32cube/xwac/init.h>
#include <bm/stm32cube/xwds/pm.h>

/******** ******** ******** ******** ******** ******** ******** ********
 ******** ******** ********       macros      ******** ******** ********
 ******** ******** ******** ******** ******** ******** ******** ********/

/******** ******** ******** ******** ******** ******** ******** ********
 ******** ********         function prototypes         ******** ********
 ******** ******** ******** ******** ******** ******** ******** ********/
extern
void SystemClock_Config(void);

/******** ******** ******** ******** ******** ******** ******** ********
 ******** ******** ********       .data       ******** ******** ********
 ******** ******** ******** ******** ******** ******** ******** ********/

/******** ******** ******** ******** ******** ******** ******** ********
 ******** ********      function implementations       ******** ********
 ******** ******** ******** ******** ******** ******** ******** ********/
void stm32cube_pm_resume(void)
{
        __maybe_unused xwer_t rc;
        xwirq_t irq;

        /* 从STOP模式恢复后，需要重新配置时钟 */
        rc = xwos_irq_get_id(&irq);
        LL_PWR_SetPowerMode(LL_PWR_MODE_STOP_MAINREGU);
        xwds_pm_resume(&stm32cube_ds);
}

void stm32cube_pm_suspend(void)
{
        __maybe_unused xwer_t rc;
        xwirq_t irq;

        rc = xwos_irq_get_id(&irq);
        xwds_pm_suspend(&stm32cube_ds);
        LL_PWR_SetPowerMode(LL_PWR_MODE_STOP_LPREGU);
        LL_LPM_EnableDeepSleep();
}

void stm32cube_pm_wakeup(void)
{
        LL_LPM_EnableSleep();
        SystemClock_Config();
}

void stm32cube_pm_sleep(void)
{
        wfi();
}
